pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
					}
					//***************************************************Y轴选定状态*******************************************************
					else if(control_panel_pram.Y_press)                   
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_Y!= override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.Y_value_temp=control_panel_pram.Y_value;
								 override.Override_num_temp_Y=override.Override_num;
								 return_workpiece_zero.Re_Y_Value=0;
								 Puless_count_clear();                   //脉冲计数寄存器清零
							}
							Show_Y_Coordinata();                          //计算脉冲并显示Y轴坐标					
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							Puless_count_clear();                   //脉冲计数寄存器清零
							control_panel_pram.Y_value_temp=0;
							control_panel_pram.Y_Pulses_counter=0;
							return_workpiece_zero.Re_Y_Value=0;
							delay_ms(20);							
              Y_coordinate_clear();                   //对Y轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //所有轴脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零														
//							XYZAB_button_reset();                   //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
						if(Send_cooddinate_status)
						{          
							Send_Y_Coordinate_to_Host();          //向主机发送Y轴坐标	
							Send_cooddinate_status=0;
						}
					}
					//*******************************************************Z轴选定状态*******************************************************
					else if(control_panel_pram.Z_press)                  
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_Z != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.Z_value_temp=control_panel_pram.Z_value;
								 override.Override_num_temp_Z = override.Override_num;
								 return_workpiece_zero.Re_Z_Value=0;
								 Puless_count_clear();              //脉冲计数寄存器清零
							}
							Show_Z_Coordinata();                 //计算脉冲并显示Z轴坐标
 
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							Puless_count_clear();                      //脉冲计数寄存器清零
							control_panel_pram.Z_value_temp=0;
							control_panel_pram.Z_Pulses_counter=0;
							return_workpiece_zero.Re_Z_Value=0;
							delay_ms(20);						
              Z_coordinate_clear();         //对Z轴工件坐标清零
							control_panel_pram.Clear_Button=0;						
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //所有轴脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零								
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
					  if(Send_cooddinate_status)
						{          
							Send_Z_Coordinate_to_Host();          //向主机发送Z轴坐标	
							Send_cooddinate_status=0;
						}
					}
					//*******************************************************A轴选定状态******************************************************
					else if(control_panel_pram.A_press)                   
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_A != override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.A_value_temp = control_panel_pram.A_value;
								 override.Override_num_temp_A = override.Override_num;
								 return_workpiece_zero.Re_A_Value=0;
								 Puless_count_clear();               //脉冲计数寄存器清零
							}
							Show_A_Coordinata();//计算脉冲并显示A轴坐标
 
							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							Puless_count_clear();                   //脉冲计数寄存器清零
							control_panel_pram.A_value_temp=0;
							control_panel_pram.A_Pulses_counter=0;
							return_workpiece_zero.Re_A_Value=0;						
              A_coordinate_clear();                  //对A轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                    //所有轴脉冲数量清零
						  All_Workpiece_coordinate_clear();      //对所有工件坐标清零								
//							XYZAB_button_reset();                  //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}
						if(Send_cooddinate_status)
						{          
							Send_A_Coordinate_to_Host();          //向主机发送A轴坐标	
							Send_cooddinate_status=0;
						}																	
					}
					//*********************************************************B轴选定状态********************************************************
					else if(control_panel_pram.B_press)                   
					{
						if(control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button==0)
						{
							if(override.Override_num_temp_B!= override.Override_num)   //倍率切换
							{	 
							   control_panel_pram.B_value_temp=control_panel_pram.B_value;
								 override.Override_num_temp_B= override.Override_num;
								return_workpiece_zero.Re_B_Value=0;
								 Puless_count_clear();             //脉冲计数寄存器清零
							}
							Show_B_Coordinata();             //计算脉冲并显示B轴坐标							
						}
						if(control_panel_pram.Clear_Button && control_panel_pram.All_Spindle_Clear_Button==0)    //清零按钮触发
						{
							Puless_count_clear();                 //脉冲计数寄存器清零
							control_panel_pram.B_value_temp=0;
							control_panel_pram.B_Pulses_counter=0;
							return_workpiece_zero.Re_B_Value=0;
							delay_ms(20);		
              B_coordinate_clear();                      	//对B轴工件坐标清零
							control_panel_pram.Clear_Button=0;
						}
						if( control_panel_pram.Clear_Button==0 && control_panel_pram.All_Spindle_Clear_Button)  //全轴清零触发
						{
							Pulses_num_Clear();                  //所有轴脉冲数量清零
						  All_Workpiece_coordinate_clear();    //对所有工件坐标清零								
//							XYZAB_button_reset();                //XYZAB坐标按钮复位
							control_panel_pram.All_Spindle_Clear_Button=0;
						}	
            if(Send_cooddinate_status)
						{          
							Send_B_Coordinate_to_Host();          //向主机发送B轴坐标	
							Send_cooddinate_status=0;
						}						
					}
					
					if(control_panel_pram.X_press || control_panel_pram.Y_press || control_panel_pram.Z_press || control_panel_pram.A_press || control_panel_pram.B_press)
					{
						TIM_Cmd(TIM2, ENABLE);                           //使能TIM2，定时向主机发送坐标							
					}
					else 
					{
					   TIM_Cmd(TIM2, DISABLE);                         //禁止TIM2，禁止向主机发送坐标
						 Send_cooddinate_status=0;
					}
          					
