pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
			  }
				else                                                 //机器处于加工状态中
				{
					 TIM_Cmd(TIM3, ENABLE);                            //使能 TIM3
					 TFT_Show_coordanate_value();			                 //显示工件和机械坐标
					
					 SetTextValue(0,21,(uchar *)file_name);            //显示正在加载的文件名	         				
					 sprintf(Working_line_buf,"%d",Working_line);  
					 SetTextValue(0,22,(uchar *)Working_line_buf);     //显示加工行数，需要向主机询问			
				}
				
			}break;
			case Return_WorkPiece_Zero_Page:   //*******************************************回工件零页面***************************************************************************************
			{ 
				TIM_Cmd(TIM4, DISABLE);         //禁止 TIM4，脉冲不计数
				if(first_time_re_workpiece)     //首次进入这个页面
				{
					SetButtonValue(3,1,0);         //所有轴显示为选中状态
					SetButtonValue(3,4,0);
					SetButtonValue(3,5,0);
					SetButtonValue(3,6,0);
					SetButtonValue(3,7,0);
					SetButtonValue(3,8,0);
					
          return_workpiece_zero.all_spindle=0;
					return_workpiece_zero.Re_X=0;
					return_workpiece_zero.Re_Y=0;
					return_workpiece_zero.Re_Z=0;
					return_workpiece_zero.Re_A=0;
					return_workpiece_zero.Re_B=0;
					
					return_workpiece_zero.Save_X_Value=control_panel_pram.X_value;   //把相应坐标值保存起来
					return_workpiece_zero.Save_Y_Value=control_panel_pram.Y_value;
				  return_workpiece_zero.Save_Z_Value=control_panel_pram.Z_value;
				  return_workpiece_zero.Save_A_Value=control_panel_pram.A_value;
				  return_workpiece_zero.Save_B_Value=control_panel_pram.B_value;
          first_time_re_workpiece=0;					
				}
				
				if(return_workpiece_zero.Re_X==0 && return_workpiece_zero.Re_Y==0 && return_workpiece_zero.Re_Z==0 && return_workpiece_zero.Re_A==0 && return_workpiece_zero.Re_B==0)   //所有轴都选中
				{
				  SetButtonValue(3,1,0);            //全轴按钮显示按下状态
				}
				else
				{
				  SetButtonValue(3,1,1);            //全轴按钮显示没按下状态
				}
				
				if(return_workpiece_zero.Sure)        //确定按钮按下
				{
					if(return_workpiece_zero.Re_X==0)
					{
						Puless_count_clear();
						control_panel_pram.X_value=0;
						control_panel_pram.X_value_temp=0;						
						control_panel_pram.X_Pulses_counter=0;
            return_workpiece_zero.Re_X_Value=0;						
					}
					else
					{
						// control_panel_pram.X_value_temp=return_workpiece_zero.Re_X_Value;
					}
					if(return_workpiece_zero.Re_Y==0)
					{
						Puless_count_clear();
						control_panel_pram.Y_value=0;
						control_panel_pram.Y_value_temp=0;						
						control_panel_pram.Y_Pulses_counter=0;
            return_workpiece_zero.Re_Y_Value=0;						
					}
					else
					{
						//control_panel_pram.Y_value_temp=return_workpiece_zero.Re_Y_Value;
					}
					if(return_workpiece_zero.Re_Z==0)
					{
						Puless_count_clear();
						control_panel_pram.Z_value=0;
						control_panel_pram.Z_value_temp=0;						
						control_panel_pram.Z_Pulses_counter=0;
            return_workpiece_zero.Re_Z_Value=0;						
					}
					else
					{
						//control_panel_pram.Z_value_temp= return_workpiece_zero.Re_Z_Value;
					}
					if(return_workpiece_zero.Re_A==0)
					{
						Puless_count_clear();
						control_panel_pram.A_value=0;
						control_panel_pram.A_value_temp=0;					
						control_panel_pram.A_Pulses_counter=0;
            return_workpiece_zero.Re_A_Value=0;						
					}
					else
					{
						//control_panel_pram.A_value_temp= return_workpiece_zero.Re_A_Value;
					}
					if(return_workpiece_zero.Re_B==0)
					{
						Puless_count_clear();
						control_panel_pram.B_value=0;
						control_panel_pram.B_value_temp=0;					
						control_panel_pram.B_Pulses_counter=0;
            return_workpiece_zero.Re_B_Value=0;						
					}
					else 
					{
						//control_panel_pram.B_value_temp= return_workpiece_zero.Re_B_Value;
					}
					return_workpiece_zero.Sure=0;				
				  Work_Page_Status=ControlPanel_Page;
				

				} 
				if(return_workpiece_zero.Cancel)    //取消按钮按下
				{
					if(return_workpiece_zero.all_spindle)
					{
						control_panel_pram.X_value=return_workpiece_zero.Save_X_Value;
						control_panel_pram.Y_value=return_workpiece_zero.Save_Y_Value;
						control_panel_pram.Z_value=return_workpiece_zero.Save_Z_Value;
						control_panel_pram.A_value=return_workpiece_zero.Save_A_Value;
						control_panel_pram.B_value=return_workpiece_zero.Save_B_Value;
						
						return_workpiece_zero.Re_X_Value=return_workpiece_zero.Save_X_Value;
						return_workpiece_zero.Re_Y_Value=return_workpiece_zero.Save_Y_Value;
						return_workpiece_zero.Re_Z_Value=return_workpiece_zero.Save_Z_Value;
						return_workpiece_zero.Re_A_Value=return_workpiece_zero.Save_A_Value;
						return_workpiece_zero.Re_B_Value=return_workpiece_zero.Save_B_Value;	
						
						control_panel_pram.X_Pulses_counter=0;
						control_panel_pram.Y_Pulses_counter=0;
						control_panel_pram.Z_Pulses_counter=0;
						control_panel_pram.A_Pulses_counter=0;
						control_panel_pram.B_Pulses_counter=0;
						
						return_workpiece_zero.Cancel=0;
					}
					
				}
       	Show_coordinate_on_return_workpiece_zero_page();  //在回工件零页面显示所有轴坐标值		
			  TFT_Show_coordanate_value();                      //在加工页面和控制面板页面显示所有轴坐标		
				
			}
			break;
			case Jump_Work_Page:     //*****************************************************跳行加工页面****************************************************************************************
			{
				
			}
				break;
			case File_Manage_Page:    //*****************************************************文件管理页面****************************************************************************************
				break;
			case Leading_In_Page:    //***************************************************** 导入页面****************************************************************************************
				break;
			case Delete_Page:         //*****************************************************删除页面****************************************************************************************
				break;
			case Storage_View_Page:    //*****************************************************内存预览页面****************************************************************************************
				break;	
			case Net_Account_Manage_Page:  //**************************************************网络与账户登录管理**********************************************************************************
				{
					switch(get_control_type)                              //控件类型判断
					{
						case kCtrlButton:                                   //按钮控件
						{							
													
							
						}break;						
						case kCtrlText:                                     //文本控件
						{
							switch(get_control_id)
							{
								case 7:
								{
									SetTextValue(11,8,(uchar *)input_buf);
								
